#+title: Heat Response 0D Closed Loop Analysis
#+author: Alex Drysdale
#+date: <2024-03-22 Fri>

#+PROPERTY: header-args:R :session *R:0D-closed-loop* :colnames yes :cache yes :exports results
#+PROPERTY: results output
#+PROPERTY: res 1000

#+begin_src R :results none
  # Loads libraries
  library(ggplot2)
  library(gridExtra)
  library(DBI)

  # Connects to database
  setwd("~/PhD/Projects/0D-closed-loop")
  db_path <- "../heat_response/data/exercise/processed_data.sqlite3"
  con <- dbConnect(RSQLite::SQLite(), dbname=db_path)

  # Controls the font size for all of the plots
  plot.text.size <- 30
  plot.theme <- theme(text=element_text(size=plot.text.size), #change font size of all text
                      axis.text=element_text(size=plot.text.size), #change font size of axis text
                      axis.title=element_text(size=plot.text.size), #change font size of axis titles
                      plot.title=element_text(size=plot.text.size), #change font size of plot title
                      legend.text=element_text(size=plot.text.size), #change font size of legend text
                      legend.title=element_text(size=plot.text.size)) #change font size of legend title 
  point.size <- 5
  line.size <- 3
#+end_src

* Visualising the fitted model parameters

#+begin_src R
  df <- dbGetQuery(con, "SELECT id, temp FROM Model_Outputs_BA")
  df$id <- as.factor(df$id)
  df$temp <- as.factor(df$temp)

  trials <- unique(df)
  trials <- trials[order(trials$id),]

  print(trials)
#+end_src

#+RESULTS[4087dff706f3429345f212cac4f3e90860ac08f3]:
| id | temp |
|----+------|
| P1 | COLD |
| P1 | TEMP |
| P1 | HEAT |
| P2 | COLD |
| P2 | TEMP |
| P2 | HEAT |
| P3 | COLD |
| P3 | TEMP |
| P3 | HEAT |
| P4 | COLD |
| P4 | TEMP |
| P4 | HEAT |
| P5 | HEAT |

#+begin_src R :results none
  # Gets the best value for each trial
  get.t.axis <- function(t, beg.end=FALSE){
    if (beg.end) {
      return(c(min(t, na.rm=TRUE), max(df$t, na.rm=TRUE)))
    }
    return(unique(t)/60)  # Converts from seconds to minutes
  }

  beg.end <- TRUE
  before.after <- ordered(c("Before", "After"), levels=c("Before", "After"))

  df.rtn <- data.frame()
  for (i in 1:nrow(trials)) {
    pid <- trials[i, ]$id
    tem <- trials[i, ]$temp

    df <- dbGetQuery(con,
                     paste(
                       "SELECT * FROM Model_Outputs WHERE id = '", pid, 
                       "' AND temp = '", tem, "'",
                       sep=""))

    t.axis <- get.t.axis(df$t, beg.end=beg.end)

    for (j in 1:length(t.axis)) {
      df.t <- subset(df, t == t.axis[j])

      min.idx <- which.min(df.t$loss)
      if (beg.end) {
        d.tmp <- df.t[min.idx,]

        t.val <- before.after[j]
        d.tmp$t <- t.val

        df.rtn <- rbind(df.rtn, d.tmp)
      } else {
        df.rtn <- rbind(df.rtn, df.t[min.idx,])
      }
    }
  }

  df.rtn$id <- as.factor(df.rtn$id)
  df.rtn$temp <- as.factor(df.rtn$temp)
#+end_src

